app/controllers/posts_controller.rb

    def create
        Post.create(post_params)
---
INSERT INTO "posts" ("description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "posty loo"], ["user_id", 1], ["created_at", "2021-08-04 19:08:41.689661"], ["updated_at", "2021-08-04 19:08:41.689661"]]