app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
---
    def show
        @user = User.find(params[:id])
        @posts = current_user.posts.order(created_at: :desc)